Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/SUI_НастройкиДокументовМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиДокументовМобильныхУстройств</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/CommonForms/SUI_ВыгрузкаДокументаНаТСД/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОткрыватьФормуВыгрузки = ПолучитьФункциональнуюОпцию("SUI_ОткрыватьВыгрузкуДокументовОбменаОфлайн");
	
	ДокументСсылка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументСсылка");
	НастройкаДокумента = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НастройкаДокумента",
		Справочники.SUI_НастройкиДокументов.ПустаяСсылка(), Тип("СправочникСсылка.SUI_НастройкиДокументов"));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(SUI_ОбщегоНазначения.СсылкаСуществует(ДокументСсылка),
		НСтр("ru = 'Ссылка документа не существует.'"));
	
	ДоступныеМобильныеКлиенты = ПолучитьДоступныхМобильныхКлиентов(НастройкаДокумента);
	
	Если ДоступныеМобильныеКлиенты.Количество() = 0 Тогда
		SUI_ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 отсутсвуют настройки для выгрузки.'"), ДокументСсылка), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Элементы.МобильноеУстройство.ПараметрыВыбора = Новый ФиксированныйМассив(SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеМобильныеКлиенты)));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры  

&НаКлиенте
Процедура КомандаВыгрузить(Команда)
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("КомандаВыгрузитьПослеПодтверждения", ЭтотОбъект);
		
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Вы действительно хотите выгрузить документ %1 для %2?'"), ДокументСсылка, 
			?(ЗначениеЗаполнено(МобильноеУстройство), СтрШаблон(НСтр("ru = 'устройства %1'"), МобильноеУстройство), НСтр("ru = 'всех доступных устройств'")));
			
		ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран документ для выгрузки на ТСД'"));
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура КомандаВыгрузитьПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("КомандаВыгрузитьЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ДлительнаяОперация = КоманадаВыгрузитьНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Выгрузка документа'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция КоманадаВыгрузитьНаСервере()
	
	ПараметрыВыгрузки = SUI_ДокументыОбмена.ПараметрыВыгрузкиДокументаОбмена();
	ПараметрыВыгрузки.МобильноеУстройство = МобильноеУстройство;
	ПараметрыВыгрузки.ДокументСсылка = ДокументСсылка;
	ПараметрыВыгрузки.НастройкаДокумента = НастройкаДокумента;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ВыгрузитьДокументОбмена", ПараметрыВыгрузки, ПараметрыВыполненияВФоне);

КонецФункции

&НаКлиенте
Процедура КомандаВыгрузитьЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;      
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("КомандаВыгрузитьПослеЗавершенияЗакрытьФорму", ЭтотОбъект, 
		Новый Структура("Сообщение, Сообщения", "", Результат.Сообщения));

	Если Результат.Статус = "Ошибка" Тогда
		ОповещениеОЗавершении.ДополнительныеПараметры.Сообщение = Результат.ПодробноеПредставлениеОшибки;
		ПоказатьПредупреждение(ОповещениеОЗавершении, Результат.КраткоеПредставлениеОшибки);
	Иначе
		
		РезультатВыгрузки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если ЗначениеЗаполнено(РезультатВыгрузки) Тогда
			ОповещениеОЗавершении.ДополнительныеПараметры.Сообщение = НСтр("ru = 'Документ был успешно выгружен'");
			КомандаВыгрузитьПослеЗавершенияЗакрытьФорму(ОповещениеОЗавершении.ДополнительныеПараметры);
		Иначе
			ПоказатьПредупреждение(ОповещениеОЗавершении, НСтр("ru = 'Документ не был выгружен'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаВыгрузитьПослеЗавершенияЗакрытьФорму(ДополнительныеПараметры) Экспорт 
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;	
	КонецЕсли;

	Закрыть();
	
	ОчиститьСообщения();
	
	Если ДополнительныеПараметры.Свойство("Сообщение") Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(ДополнительныеПараметры.Сообщение);	
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("Сообщения") Тогда 

		Для Каждого Сообщение Из ДополнительныеПараметры.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;  
		
	КонецЕсли;

	Оповестить("SUI_ПослеВыгрузкиДокументаОбмена");                
	
	Если SUI_ИнтеграцияВКонфигурациюВызовСервера.ИспользуетсяВариантОбменаОфлайн() И ОткрыватьФормуВыгрузки Тогда
		ОткрытьФорму("Обработка.SUI_РабочееМестоОператораОбмена.Форма.ОбменСПользователямиОфлайн", , ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДоступныхМобильныхКлиентов(НастройкаДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	SUI_НастройкиДокументовМобильныхКлиентов.МобильноеУстройство
		|ИЗ
		|	РегистрСведений.SUI_НастройкиДокументовМобильныхУстройств КАК SUI_НастройкиДокументовМобильныхКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|		ПО SUI_НастройкиДокументовМобильныхКлиентов.МобильноеУстройство = SUI_МобильныеУстройства.Ссылка
		|ГДЕ
		|	SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента = &НастройкаДокумента
		|	И НЕ SUI_МобильныеУстройства.ПометкаУдаления
		|	И НЕ SUI_МобильныеУстройства.ЭтотУзел
		|	И НЕ SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента.ПометкаУдаления
		|	И SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента.Используется";
	
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МобильноеУстройство");

КонецФункции

#КонецОбласти
